certora/mutations/gambit_ghoAToken/bug1.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoAToken.sol b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
index 8cb1587..6a0a0de 100644
--- a/src/contracts/facilitators/aave/tokens/GhoAToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
@@ -67,7 +67,8 @@ contract GhoAToken is VersionedInitializable, ScaledBalanceTokenBase, EIP712Base
     string calldata aTokenSymbol,
     bytes calldata params
   ) external override initializer {
-    require(initializingPool == POOL, Errors.POOL_ADDRESSES_DO_NOT_MATCH);
+    /// DeleteExpressionMutation(`require(initializingPool == POOL, Errors.POOL_ADDRESSES_DO_NOT_MATCH)` |==> `assert(true)`) of: `require(initializingPool == POOL, Errors.POOL_ADDRESSES_DO_NOT_MATCH);`
+    assert(true);
     _setName(aTokenName);
     _setSymbol(aTokenSymbol);
     _setDecimals(aTokenDecimals);
