certora/mutations/gambit_ghoAToken/bug20.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoAToken.sol b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
index 8cb1587..2eebff7 100644
--- a/src/contracts/facilitators/aave/tokens/GhoAToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
@@ -167,7 +167,8 @@ contract GhoAToken is VersionedInitializable, ScaledBalanceTokenBase, EIP712Base
     if (amount <= balanceFromInterest) {
       _ghoVariableDebtToken.decreaseBalanceFromInterest(onBehalfOf, amount);
     } else {
-      _ghoVariableDebtToken.decreaseBalanceFromInterest(onBehalfOf, balanceFromInterest);
+      /// DeleteExpressionMutation(`_ghoVariableDebtToken.decreaseBalanceFromInterest(onBehalfOf, balanceFromInterest)` |==> `assert(true)`) of: `_ghoVariableDebtToken.decreaseBalanceFromInterest(onBehalfOf, balanceFromInterest);`
+      assert(true);
       IGhoToken(_underlyingAsset).burn(amount - balanceFromInterest);
     }
   }
