certora/mutations/gambit_ghoAToken/bug28.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoAToken.sol b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
index 8cb1587..015ad3e 100644
--- a/src/contracts/facilitators/aave/tokens/GhoAToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
@@ -165,7 +165,8 @@ contract GhoAToken is VersionedInitializable, ScaledBalanceTokenBase, EIP712Base
   ) external virtual override onlyPool {
     uint256 balanceFromInterest = _ghoVariableDebtToken.getBalanceFromInterest(onBehalfOf);
     if (amount <= balanceFromInterest) {
-      _ghoVariableDebtToken.decreaseBalanceFromInterest(onBehalfOf, amount);
+      /// DeleteExpressionMutation(`_ghoVariableDebtToken.decreaseBalanceFromInterest(onBehalfOf, amount)` |==> `assert(true)`) of: `_ghoVariableDebtToken.decreaseBalanceFromInterest(onBehalfOf, amount);`
+      assert(true);
     } else {
       _ghoVariableDebtToken.decreaseBalanceFromInterest(onBehalfOf, balanceFromInterest);
       IGhoToken(_underlyingAsset).burn(amount - balanceFromInterest);
