certora/mutations/gambit_ghoAToken/bug32.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoAToken.sol b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
index 8cb1587..c88cff4 100644
--- a/src/contracts/facilitators/aave/tokens/GhoAToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
@@ -225,7 +225,8 @@ contract GhoAToken is VersionedInitializable, ScaledBalanceTokenBase, EIP712Base
 
   /// @inheritdoc IAToken
   function rescueTokens(address token, address to, uint256 amount) external override onlyPoolAdmin {
-    require(token != _underlyingAsset, Errors.UNDERLYING_CANNOT_BE_RESCUED);
+    /// DeleteExpressionMutation(`require(token != _underlyingAsset, Errors.UNDERLYING_CANNOT_BE_RESCUED)` |==> `assert(true)`) of: `require(token != _underlyingAsset, Errors.UNDERLYING_CANNOT_BE_RESCUED);`
+    assert(true);
     IERC20(token).safeTransfer(to, amount);
   }
 
