certora/mutations/gambit_ghoAToken/bug35.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoAToken.sol b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
index 8cb1587..87b237c 100644
--- a/src/contracts/facilitators/aave/tokens/GhoAToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
@@ -226,7 +226,8 @@ contract GhoAToken is VersionedInitializable, ScaledBalanceTokenBase, EIP712Base
   /// @inheritdoc IAToken
   function rescueTokens(address token, address to, uint256 amount) external override onlyPoolAdmin {
     require(token != _underlyingAsset, Errors.UNDERLYING_CANNOT_BE_RESCUED);
-    IERC20(token).safeTransfer(to, amount);
+    /// DeleteExpressionMutation(`IERC20(token).safeTransfer(to, amount)` |==> `assert(true)`) of: `IERC20(token).safeTransfer(to, amount);`
+    assert(true);
   }
 
   /// @inheritdoc IGhoAToken
