certora/mutations/gambit_ghoAToken/bug4.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoAToken.sol b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
index 8cb1587..67b04fa 100644
--- a/src/contracts/facilitators/aave/tokens/GhoAToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
@@ -68,7 +68,8 @@ contract GhoAToken is VersionedInitializable, ScaledBalanceTokenBase, EIP712Base
     bytes calldata params
   ) external override initializer {
     require(initializingPool == POOL, Errors.POOL_ADDRESSES_DO_NOT_MATCH);
-    _setName(aTokenName);
+    /// DeleteExpressionMutation(`_setName(aTokenName)` |==> `assert(true)`) of: `_setName(aTokenName);`
+    assert(true);
     _setSymbol(aTokenSymbol);
     _setDecimals(aTokenDecimals);
 
