certora/mutations/gambit_ghoAToken/bug42.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoAToken.sol b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
index 8cb1587..fdeecea 100644
--- a/src/contracts/facilitators/aave/tokens/GhoAToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
@@ -233,7 +233,8 @@ contract GhoAToken is VersionedInitializable, ScaledBalanceTokenBase, EIP712Base
   function setVariableDebtToken(address ghoVariableDebtToken) external override onlyPoolAdmin {
     require(address(_ghoVariableDebtToken) == address(0), 'VARIABLE_DEBT_TOKEN_ALREADY_SET');
     require(ghoVariableDebtToken != address(0), 'ZERO_ADDRESS_NOT_VALID');
-    _ghoVariableDebtToken = GhoVariableDebtToken(ghoVariableDebtToken);
+    /// DeleteExpressionMutation(`_ghoVariableDebtToken = GhoVariableDebtToken(ghoVariableDebtToken)` |==> `assert(true)`) of: `_ghoVariableDebtToken = GhoVariableDebtToken(ghoVariableDebtToken);`
+    assert(true);
     emit VariableDebtTokenSet(ghoVariableDebtToken);
   }
 
