certora/mutations/gambit_ghoAToken/bug45.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoAToken.sol b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
index 8cb1587..409f3b2 100644
--- a/src/contracts/facilitators/aave/tokens/GhoAToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
@@ -244,7 +244,8 @@ contract GhoAToken is VersionedInitializable, ScaledBalanceTokenBase, EIP712Base
 
   /// @inheritdoc IGhoFacilitator
   function updateGhoTreasury(address newGhoTreasury) external override onlyPoolAdmin {
-    require(newGhoTreasury != address(0), 'ZERO_ADDRESS_NOT_VALID');
+    /// RequireMutation(`newGhoTreasury != address(0)` |==> `false`) of: `require(newGhoTreasury != address(0), 'ZERO_ADDRESS_NOT_VALID');`
+    require(false, 'ZERO_ADDRESS_NOT_VALID');
     address oldGhoTreasury = _ghoTreasury;
     _ghoTreasury = newGhoTreasury;
     emit GhoTreasuryUpdated(oldGhoTreasury, newGhoTreasury);
