certora/mutations/gambit_ghoAToken/bug46.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoAToken.sol b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
index 8cb1587..8ac1207 100644
--- a/src/contracts/facilitators/aave/tokens/GhoAToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
@@ -246,7 +246,8 @@ contract GhoAToken is VersionedInitializable, ScaledBalanceTokenBase, EIP712Base
   function updateGhoTreasury(address newGhoTreasury) external override onlyPoolAdmin {
     require(newGhoTreasury != address(0), 'ZERO_ADDRESS_NOT_VALID');
     address oldGhoTreasury = _ghoTreasury;
-    _ghoTreasury = newGhoTreasury;
+    /// DeleteExpressionMutation(`_ghoTreasury = newGhoTreasury` |==> `assert(true)`) of: `_ghoTreasury = newGhoTreasury;`
+    assert(true);
     emit GhoTreasuryUpdated(oldGhoTreasury, newGhoTreasury);
   }
 
