certora/mutations/gambit_ghoAToken/bug9.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoAToken.sol b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
index 8cb1587..96a23a1 100644
--- a/src/contracts/facilitators/aave/tokens/GhoAToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
@@ -74,7 +74,8 @@ contract GhoAToken is VersionedInitializable, ScaledBalanceTokenBase, EIP712Base
 
     _treasury = treasury;
     _underlyingAsset = underlyingAsset;
-    _incentivesController = incentivesController;
+    /// DeleteExpressionMutation(`_incentivesController = incentivesController` |==> `assert(true)`) of: `_incentivesController = incentivesController;`
+    assert(true);
 
     _domainSeparator = _calculateDomainSeparator();
 
