certora/mutations/gambit_ghoFlashMinter/bug10.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..7133635 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -71,11 +71,12 @@ contract GhoFlashMinter is IGhoFlashMinter {
     uint256 amount,
     bytes calldata data
   ) external override returns (bool) {
-    require(token == address(GHO_TOKEN), 'FlashMinter: Unsupported currency');
+    /// DeleteExpressionMutation(`require(token == address(GHO_TOKEN), 'FlashMinter: Unsupported currency')` |==> `assert(true)`) of: `require(token == address(GHO_TOKEN), 'FlashMinter: Unsupported currency');`
+    assert(true);
 
     uint256 fee = ACL_MANAGER.isFlashBorrower(msg.sender) ? 0 : _flashFee(amount);
     GHO_TOKEN.mint(address(receiver), amount);
-
+    
     require(
       receiver.onFlashLoan(msg.sender, address(GHO_TOKEN), amount, fee, data) == CALLBACK_SUCCESS,
       'FlashMinter: Callback failed'
