certora/mutations/gambit_ghoFlashMinter/bug12.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..ce0fcda 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -71,11 +71,12 @@ contract GhoFlashMinter is IGhoFlashMinter {
     uint256 amount,
     bytes calldata data
   ) external override returns (bool) {
-    require(token == address(GHO_TOKEN), 'FlashMinter: Unsupported currency');
+    /// RequireMutation(`token == address(GHO_TOKEN)` |==> `false`) of: `require(token == address(GHO_TOKEN), 'FlashMinter: Unsupported currency');`
+    require(false, 'FlashMinter: Unsupported currency');
 
     uint256 fee = ACL_MANAGER.isFlashBorrower(msg.sender) ? 0 : _flashFee(amount);
     GHO_TOKEN.mint(address(receiver), amount);
-
+    
     require(
       receiver.onFlashLoan(msg.sender, address(GHO_TOKEN), amount, fee, data) == CALLBACK_SUCCESS,
       'FlashMinter: Callback failed'
