certora/mutations/gambit_ghoFlashMinter/bug13.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..5c137c4 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -74,8 +74,9 @@ contract GhoFlashMinter is IGhoFlashMinter {
     require(token == address(GHO_TOKEN), 'FlashMinter: Unsupported currency');
 
     uint256 fee = ACL_MANAGER.isFlashBorrower(msg.sender) ? 0 : _flashFee(amount);
-    GHO_TOKEN.mint(address(receiver), amount);
-
+    /// DeleteExpressionMutation(`GHO_TOKEN.mint(address(receiver), amount)` |==> `assert(true)`) of: `GHO_TOKEN.mint(address(receiver), amount);`
+    assert(true);
+    
     require(
       receiver.onFlashLoan(msg.sender, address(GHO_TOKEN), amount, fee, data) == CALLBACK_SUCCESS,
       'FlashMinter: Callback failed'
