certora/mutations/gambit_ghoFlashMinter/bug2.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..544c54c 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -44,7 +44,8 @@ contract GhoFlashMinter is IGhoFlashMinter {
    * @dev Only pool admin can call functions marked by this modifier.
    */
   modifier onlyPoolAdmin() {
-    require(ACL_MANAGER.isPoolAdmin(msg.sender), 'CALLER_NOT_POOL_ADMIN');
+    /// RequireMutation(`ACL_MANAGER.isPoolAdmin(msg.sender)` |==> `true`) of: `require(ACL_MANAGER.isPoolAdmin(msg.sender), 'CALLER_NOT_POOL_ADMIN');`
+    require(true, 'CALLER_NOT_POOL_ADMIN');
     _;
   }
 
@@ -75,7 +76,7 @@ contract GhoFlashMinter is IGhoFlashMinter {
 
     uint256 fee = ACL_MANAGER.isFlashBorrower(msg.sender) ? 0 : _flashFee(amount);
     GHO_TOKEN.mint(address(receiver), amount);
-
+    
     require(
       receiver.onFlashLoan(msg.sender, address(GHO_TOKEN), amount, fee, data) == CALLBACK_SUCCESS,
       'FlashMinter: Callback failed'
