certora/mutations/gambit_ghoFlashMinter/bug23.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..5c9cbd9 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -75,7 +75,7 @@ contract GhoFlashMinter is IGhoFlashMinter {
 
     uint256 fee = ACL_MANAGER.isFlashBorrower(msg.sender) ? 0 : _flashFee(amount);
     GHO_TOKEN.mint(address(receiver), amount);
-
+    
     require(
       receiver.onFlashLoan(msg.sender, address(GHO_TOKEN), amount, fee, data) == CALLBACK_SUCCESS,
       'FlashMinter: Callback failed'
@@ -92,7 +92,8 @@ contract GhoFlashMinter is IGhoFlashMinter {
   /// @inheritdoc IGhoFacilitator
   function distributeFeesToTreasury() external override {
     uint256 balance = GHO_TOKEN.balanceOf(address(this));
-    GHO_TOKEN.transfer(_ghoTreasury, balance);
+    /// DeleteExpressionMutation(`GHO_TOKEN.transfer(_ghoTreasury, balance)` |==> `assert(true)`) of: `GHO_TOKEN.transfer(_ghoTreasury, balance);`
+    assert(true);
     emit FeesDistributedToTreasury(_ghoTreasury, address(GHO_TOKEN), balance);
   }
 
