certora/mutations/gambit_ghoFlashMinter/bug25.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..59c920d 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -75,7 +75,7 @@ contract GhoFlashMinter is IGhoFlashMinter {
 
     uint256 fee = ACL_MANAGER.isFlashBorrower(msg.sender) ? 0 : _flashFee(amount);
     GHO_TOKEN.mint(address(receiver), amount);
-
+    
     require(
       receiver.onFlashLoan(msg.sender, address(GHO_TOKEN), amount, fee, data) == CALLBACK_SUCCESS,
       'FlashMinter: Callback failed'
@@ -103,7 +103,8 @@ contract GhoFlashMinter is IGhoFlashMinter {
 
   /// @inheritdoc IGhoFacilitator
   function updateGhoTreasury(address newGhoTreasury) external override onlyPoolAdmin {
-    _updateGhoTreasury(newGhoTreasury);
+    /// DeleteExpressionMutation(`_updateGhoTreasury(newGhoTreasury)` |==> `assert(true)`) of: `_updateGhoTreasury(newGhoTreasury);`
+    assert(true);
   }
 
   /// @inheritdoc IERC3156FlashLender
