certora/mutations/gambit_ghoFlashMinter/bug26.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..565326c 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -75,7 +75,7 @@ contract GhoFlashMinter is IGhoFlashMinter {
 
     uint256 fee = ACL_MANAGER.isFlashBorrower(msg.sender) ? 0 : _flashFee(amount);
     GHO_TOKEN.mint(address(receiver), amount);
-
+    
     require(
       receiver.onFlashLoan(msg.sender, address(GHO_TOKEN), amount, fee, data) == CALLBACK_SUCCESS,
       'FlashMinter: Callback failed'
@@ -108,7 +108,8 @@ contract GhoFlashMinter is IGhoFlashMinter {
 
   /// @inheritdoc IERC3156FlashLender
   function maxFlashLoan(address token) external view override returns (uint256) {
-    if (token != address(GHO_TOKEN)) {
+    /// IfStatementMutation(`token != address(GHO_TOKEN)` |==> `true`) of: `if (token != address(GHO_TOKEN)) {`
+    if (true) {
       return 0;
     } else {
       (uint256 capacity, uint256 level) = GHO_TOKEN.getFacilitatorBucket(address(this));
