certora/mutations/gambit_ghoFlashMinter/bug29.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..cd29c8d 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -75,7 +75,7 @@ contract GhoFlashMinter is IGhoFlashMinter {
 
     uint256 fee = ACL_MANAGER.isFlashBorrower(msg.sender) ? 0 : _flashFee(amount);
     GHO_TOKEN.mint(address(receiver), amount);
-
+    
     require(
       receiver.onFlashLoan(msg.sender, address(GHO_TOKEN), amount, fee, data) == CALLBACK_SUCCESS,
       'FlashMinter: Callback failed'
@@ -112,7 +112,8 @@ contract GhoFlashMinter is IGhoFlashMinter {
       return 0;
     } else {
       (uint256 capacity, uint256 level) = GHO_TOKEN.getFacilitatorBucket(address(this));
-      return capacity > level ? capacity - level : 0;
+      /// BinaryOpMutation(`-` |==> `+`) of: `return capacity > level ? capacity - level : 0;`
+      return capacity > level ? capacity+level : 0;
     }
   }
 
