certora/mutations/gambit_ghoFlashMinter/bug41.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..5c761cb 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -75,7 +75,7 @@ contract GhoFlashMinter is IGhoFlashMinter {
 
     uint256 fee = ACL_MANAGER.isFlashBorrower(msg.sender) ? 0 : _flashFee(amount);
     GHO_TOKEN.mint(address(receiver), amount);
-
+    
     require(
       receiver.onFlashLoan(msg.sender, address(GHO_TOKEN), amount, fee, data) == CALLBACK_SUCCESS,
       'FlashMinter: Callback failed'
@@ -143,7 +143,8 @@ contract GhoFlashMinter is IGhoFlashMinter {
   }
 
   function _updateFee(uint256 newFee) internal {
-    require(newFee <= MAX_FEE, 'FlashMinter: Fee out of range');
+    /// SwapArgumentsOperatorMutation(`newFee <= MAX_FEE` |==> `MAX_FEE <= newFee`) of: `require(newFee <= MAX_FEE, 'FlashMinter: Fee out of range');`
+    require(MAX_FEE <= newFee, 'FlashMinter: Fee out of range');
     uint256 oldFee = _fee;
     _fee = newFee;
     emit FeeUpdated(oldFee, newFee);
