certora/mutations/gambit_ghoFlashMinter/bug45.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..f67f927 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -75,7 +75,7 @@ contract GhoFlashMinter is IGhoFlashMinter {
 
     uint256 fee = ACL_MANAGER.isFlashBorrower(msg.sender) ? 0 : _flashFee(amount);
     GHO_TOKEN.mint(address(receiver), amount);
-
+    
     require(
       receiver.onFlashLoan(msg.sender, address(GHO_TOKEN), amount, fee, data) == CALLBACK_SUCCESS,
       'FlashMinter: Callback failed'
@@ -151,7 +151,8 @@ contract GhoFlashMinter is IGhoFlashMinter {
 
   function _updateGhoTreasury(address newGhoTreasury) internal {
     address oldGhoTreasury = _ghoTreasury;
-    _ghoTreasury = newGhoTreasury;
+    /// DeleteExpressionMutation(`_ghoTreasury = newGhoTreasury` |==> `assert(true)`) of: `_ghoTreasury = newGhoTreasury;`
+    assert(true);
     emit GhoTreasuryUpdated(oldGhoTreasury, newGhoTreasury);
   }
 }
