certora/mutations/gambit_ghoToken/bug11.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..fa5b479 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -37,7 +37,8 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
 
     uint256 currentBucketLevel = f.bucketLevel;
     uint256 newBucketLevel = currentBucketLevel + amount;
-    require(f.bucketCapacity >= newBucketLevel, 'FACILITATOR_BUCKET_CAPACITY_EXCEEDED');
+    /// DeleteExpressionMutation(`require(f.bucketCapacity >= newBucketLevel, 'FACILITATOR_BUCKET_CAPACITY_EXCEEDED')` |==> `assert(true)`) of: `require(f.bucketCapacity >= newBucketLevel, 'FACILITATOR_BUCKET_CAPACITY_EXCEEDED');`
+    assert(true);
     f.bucketLevel = uint128(newBucketLevel);
 
     _mint(account, amount);
