certora/mutations/gambit_ghoToken/bug14.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..cd197c1 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -37,7 +37,8 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
 
     uint256 currentBucketLevel = f.bucketLevel;
     uint256 newBucketLevel = currentBucketLevel + amount;
-    require(f.bucketCapacity >= newBucketLevel, 'FACILITATOR_BUCKET_CAPACITY_EXCEEDED');
+    /// SwapArgumentsOperatorMutation(`f.bucketCapacity >= newBucketLevel` |==> `newBucketLevel >= f.bucketCapacity`) of: `require(f.bucketCapacity >= newBucketLevel, 'FACILITATOR_BUCKET_CAPACITY_EXCEEDED');`
+    require(newBucketLevel >= f.bucketCapacity, 'FACILITATOR_BUCKET_CAPACITY_EXCEEDED');
     f.bucketLevel = uint128(newBucketLevel);
 
     _mint(account, amount);
