certora/mutations/gambit_ghoToken/bug16.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..53b162f 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -38,7 +38,8 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     uint256 currentBucketLevel = f.bucketLevel;
     uint256 newBucketLevel = currentBucketLevel + amount;
     require(f.bucketCapacity >= newBucketLevel, 'FACILITATOR_BUCKET_CAPACITY_EXCEEDED');
-    f.bucketLevel = uint128(newBucketLevel);
+    /// AssignmentMutation(`uint128(newBucketLevel)` |==> `0`) of: `f.bucketLevel = uint128(newBucketLevel);`
+    f.bucketLevel = 0;
 
     _mint(account, amount);
 
