certora/mutations/gambit_ghoToken/bug18.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..1ff983f 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -40,7 +40,8 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     require(f.bucketCapacity >= newBucketLevel, 'FACILITATOR_BUCKET_CAPACITY_EXCEEDED');
     f.bucketLevel = uint128(newBucketLevel);
 
-    _mint(account, amount);
+    /// DeleteExpressionMutation(`_mint(account, amount)` |==> `assert(true)`) of: `_mint(account, amount);`
+    assert(true);
 
     emit FacilitatorBucketLevelUpdated(msg.sender, currentBucketLevel, newBucketLevel);
   }
