certora/mutations/gambit_ghoToken/bug29.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..eacc9cd 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -52,7 +52,8 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     Facilitator storage f = _facilitators[msg.sender];
     uint256 currentBucketLevel = f.bucketLevel;
     uint256 newBucketLevel = currentBucketLevel - amount;
-    f.bucketLevel = uint128(newBucketLevel);
+    /// DeleteExpressionMutation(`f.bucketLevel = uint128(newBucketLevel)` |==> `assert(true)`) of: `f.bucketLevel = uint128(newBucketLevel);`
+    assert(true);
 
     _burn(msg.sender, amount);
 
