certora/mutations/gambit_ghoToken/bug40.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..13e54c6 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -69,7 +69,8 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     require(bytes(facilitator.label).length == 0, 'FACILITATOR_ALREADY_EXISTS');
     require(bytes(facilitatorLabel).length > 0, 'INVALID_LABEL');
 
-    facilitator.label = facilitatorLabel;
+    /// DeleteExpressionMutation(`facilitator.label = facilitatorLabel` |==> `assert(true)`) of: `facilitator.label = facilitatorLabel;`
+    assert(true);
     facilitator.bucketCapacity = bucketCapacity;
 
     _facilitatorsList.add(facilitatorAddress);
