certora/mutations/gambit_ghoToken/bug41.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..37eeae3 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -70,7 +70,8 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     require(bytes(facilitatorLabel).length > 0, 'INVALID_LABEL');
 
     facilitator.label = facilitatorLabel;
-    facilitator.bucketCapacity = bucketCapacity;
+    /// DeleteExpressionMutation(`facilitator.bucketCapacity = bucketCapacity` |==> `assert(true)`) of: `facilitator.bucketCapacity = bucketCapacity;`
+    assert(true);
 
     _facilitatorsList.add(facilitatorAddress);
 
