certora/mutations/gambit_ghoToken/bug43.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..99052ee 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -70,7 +70,8 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     require(bytes(facilitatorLabel).length > 0, 'INVALID_LABEL');
 
     facilitator.label = facilitatorLabel;
-    facilitator.bucketCapacity = bucketCapacity;
+    /// AssignmentMutation(`bucketCapacity` |==> `1`) of: `facilitator.bucketCapacity = bucketCapacity;`
+    facilitator.bucketCapacity = 1;
 
     _facilitatorsList.add(facilitatorAddress);
 
