certora/mutations/gambit_ghoToken/bug46.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..e577bd0 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -86,7 +86,8 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     address facilitatorAddress
   ) external onlyRole(FACILITATOR_MANAGER_ROLE) {
     require(
-      bytes(_facilitators[facilitatorAddress].label).length > 0,
+      /// RequireMutation(`bytes(_facilitators[facilitatorAddress].label).length > 0` |==> `false`) of: `bytes(_facilitators[facilitatorAddress].label).length > 0,`
+      false,
       'FACILITATOR_DOES_NOT_EXIST'
     );
     require(
