certora/mutations/gambit_ghoToken/bug5.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..d87c70f 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -32,7 +32,8 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
 
   /// @inheritdoc IGhoToken
   function mint(address account, uint256 amount) external {
-    require(amount > 0, 'INVALID_MINT_AMOUNT');
+    /// SwapArgumentsOperatorMutation(`amount > 0` |==> `0 > amount`) of: `require(amount > 0, 'INVALID_MINT_AMOUNT');`
+    require(0 > amount, 'INVALID_MINT_AMOUNT');
     Facilitator storage f = _facilitators[msg.sender];
 
     uint256 currentBucketLevel = f.bucketLevel;
