certora/mutations/gambit_ghoToken/bug53.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..2438b7a 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -105,7 +105,8 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     address facilitator,
     uint128 newCapacity
   ) external onlyRole(BUCKET_MANAGER_ROLE) {
-    require(bytes(_facilitators[facilitator].label).length > 0, 'FACILITATOR_DOES_NOT_EXIST');
+    /// RequireMutation(`bytes(_facilitators[facilitator].label).length > 0` |==> `true`) of: `require(bytes(_facilitators[facilitator].label).length > 0, 'FACILITATOR_DOES_NOT_EXIST');`
+    require(true, 'FACILITATOR_DOES_NOT_EXIST');
 
     uint256 oldCapacity = _facilitators[facilitator].bucketCapacity;
     _facilitators[facilitator].bucketCapacity = newCapacity;
