certora/mutations/gambit_ghoToken/bug55.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..1c8d747 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -105,7 +105,8 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     address facilitator,
     uint128 newCapacity
   ) external onlyRole(BUCKET_MANAGER_ROLE) {
-    require(bytes(_facilitators[facilitator].label).length > 0, 'FACILITATOR_DOES_NOT_EXIST');
+    /// SwapArgumentsOperatorMutation(`bytes(_facilitators[facilitator].label).length > 0` |==> `0 > bytes(_facilitators[facilitator].label).length`) of: `require(bytes(_facilitators[facilitator].label).length > 0, 'FACILITATOR_DOES_NOT_EXIST');`
+    require(0 > bytes(_facilitators[facilitator].label).length, 'FACILITATOR_DOES_NOT_EXIST');
 
     uint256 oldCapacity = _facilitators[facilitator].bucketCapacity;
     _facilitators[facilitator].bucketCapacity = newCapacity;
