certora/mutations/gambit_ghoToken/bug56.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..1a82503 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -108,7 +108,8 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     require(bytes(_facilitators[facilitator].label).length > 0, 'FACILITATOR_DOES_NOT_EXIST');
 
     uint256 oldCapacity = _facilitators[facilitator].bucketCapacity;
-    _facilitators[facilitator].bucketCapacity = newCapacity;
+    /// DeleteExpressionMutation(`_facilitators[facilitator].bucketCapacity = newCapacity` |==> `assert(true)`) of: `_facilitators[facilitator].bucketCapacity = newCapacity;`
+    assert(true);
 
     emit FacilitatorBucketCapacityUpdated(facilitator, oldCapacity, newCapacity);
   }
