certora/mutations/gambit_ghoVariableDebtToken/bug10.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..b8d2c7e 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -92,7 +92,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     bytes calldata params
   ) external override initializer {
     require(initializingPool == POOL, Errors.POOL_ADDRESSES_DO_NOT_MATCH);
-    _setName(debtTokenName);
+    /// DeleteExpressionMutation(`_setName(debtTokenName)` |==> `assert(true)`) of: `_setName(debtTokenName);`
+    assert(true);
     _setSymbol(debtTokenSymbol);
     _setDecimals(debtTokenDecimals);
 
