certora/mutations/gambit_ghoVariableDebtToken/bug107.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..852a126 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -400,7 +400,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
       discountPercent
     );
 
-    uint256 amountToMint = amount + balanceIncrease;
+    /// BinaryOpMutation(`+` |==> `**`) of: `uint256 amountToMint = amount + balanceIncrease;`
+    uint256 amountToMint = amount**balanceIncrease;
     emit Transfer(address(0), onBehalfOf, amountToMint);
     emit Mint(caller, onBehalfOf, amountToMint, balanceIncrease, index);
 
