certora/mutations/gambit_ghoVariableDebtToken/bug108.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..6e2c472 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -423,7 +423,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     uint256 index
   ) internal override {
     uint256 amountScaled = amount.rayDiv(index);
-    require(amountScaled != 0, Errors.INVALID_BURN_AMOUNT);
+    /// DeleteExpressionMutation(`require(amountScaled != 0, Errors.INVALID_BURN_AMOUNT)` |==> `assert(true)`) of: `require(amountScaled != 0, Errors.INVALID_BURN_AMOUNT);`
+    assert(true);
 
     uint256 balanceBeforeBurn = balanceOf(user);
 
