certora/mutations/gambit_ghoVariableDebtToken/bug11.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..4196663 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -93,7 +93,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
   ) external override initializer {
     require(initializingPool == POOL, Errors.POOL_ADDRESSES_DO_NOT_MATCH);
     _setName(debtTokenName);
-    _setSymbol(debtTokenSymbol);
+    /// DeleteExpressionMutation(`_setSymbol(debtTokenSymbol)` |==> `assert(true)`) of: `_setSymbol(debtTokenSymbol);`
+    assert(true);
     _setDecimals(debtTokenDecimals);
 
     _underlyingAsset = underlyingAsset;
