certora/mutations/gambit_ghoVariableDebtToken/bug110.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..aa6e7b8 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -423,7 +423,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     uint256 index
   ) internal override {
     uint256 amountScaled = amount.rayDiv(index);
-    require(amountScaled != 0, Errors.INVALID_BURN_AMOUNT);
+    /// RequireMutation(`amountScaled != 0` |==> `false`) of: `require(amountScaled != 0, Errors.INVALID_BURN_AMOUNT);`
+    require(false, Errors.INVALID_BURN_AMOUNT);
 
     uint256 balanceBeforeBurn = balanceOf(user);
 
