certora/mutations/gambit_ghoVariableDebtToken/bug113.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..c0d1e39 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -439,7 +439,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     if (amount == balanceBeforeBurn) {
       _burn(user, previousScaledBalance.toUint128());
     } else {
-      _burn(user, (amountScaled + discountScaled).toUint128());
+      /// DeleteExpressionMutation(`_burn(user, (amountScaled + discountScaled).toUint128())` |==> `assert(true)`) of: `_burn(user, (amountScaled + discountScaled).toUint128());`
+      assert(true);
     }
 
     _refreshDiscountPercent(
