certora/mutations/gambit_ghoVariableDebtToken/bug119.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..b9fda1e 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -437,7 +437,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     );
 
     if (amount == balanceBeforeBurn) {
-      _burn(user, previousScaledBalance.toUint128());
+      /// DeleteExpressionMutation(`_burn(user, previousScaledBalance.toUint128())` |==> `assert(true)`) of: `_burn(user, previousScaledBalance.toUint128());`
+      assert(true);
     } else {
       _burn(user, (amountScaled + discountScaled).toUint128());
     }
