certora/mutations/gambit_ghoVariableDebtToken/bug12.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..e803f87 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -94,7 +94,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     require(initializingPool == POOL, Errors.POOL_ADDRESSES_DO_NOT_MATCH);
     _setName(debtTokenName);
     _setSymbol(debtTokenSymbol);
-    _setDecimals(debtTokenDecimals);
+    /// DeleteExpressionMutation(`_setDecimals(debtTokenDecimals)` |==> `assert(true)`) of: `_setDecimals(debtTokenDecimals);`
+    assert(true);
 
     _underlyingAsset = underlyingAsset;
     _incentivesController = incentivesController;
