certora/mutations/gambit_ghoVariableDebtToken/bug122.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..b7af469 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -449,7 +449,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
       discountPercent
     );
 
-    if (balanceIncrease > amount) {
+    /// SwapArgumentsOperatorMutation(`balanceIncrease > amount` |==> `amount > balanceIncrease`) of: `if (balanceIncrease > amount) {`
+    if (amount > balanceIncrease) {
       uint256 amountToMint = balanceIncrease - amount;
       emit Transfer(address(0), user, amountToMint);
       emit Mint(user, user, amountToMint, balanceIncrease, index);
