certora/mutations/gambit_ghoVariableDebtToken/bug140.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..54414af 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -480,7 +480,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
       previousScaledBalance.rayMul(_userState[user].additionalData);
 
     uint256 discountScaled = 0;
-    if (balanceIncrease != 0 && discountPercent != 0) {
+    /// IfStatementMutation(`balanceIncrease != 0 && discountPercent != 0` |==> `true`) of: `if (balanceIncrease != 0 && discountPercent != 0) {`
+    if (true) {
       uint256 discount = balanceIncrease.percentMul(discountPercent);
       discountScaled = discount.rayDiv(index);
       balanceIncrease = balanceIncrease - discount;
