certora/mutations/gambit_ghoVariableDebtToken/bug145.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..14627ce 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -483,7 +483,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     if (balanceIncrease != 0 && discountPercent != 0) {
       uint256 discount = balanceIncrease.percentMul(discountPercent);
       discountScaled = discount.rayDiv(index);
-      balanceIncrease = balanceIncrease - discount;
+      /// DeleteExpressionMutation(`balanceIncrease = balanceIncrease - discount` |==> `assert(true)`) of: `balanceIncrease = balanceIncrease - discount;`
+      assert(true);
     }
 
     _userState[user].additionalData = index.toUint128();
