certora/mutations/gambit_ghoVariableDebtToken/bug152.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..5cc9b3b 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -483,7 +483,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     if (balanceIncrease != 0 && discountPercent != 0) {
       uint256 discount = balanceIncrease.percentMul(discountPercent);
       discountScaled = discount.rayDiv(index);
-      balanceIncrease = balanceIncrease - discount;
+      /// BinaryOpMutation(`-` |==> `**`) of: `balanceIncrease = balanceIncrease - discount;`
+      balanceIncrease = balanceIncrease**discount;
     }
 
     _userState[user].additionalData = index.toUint128();
