certora/mutations/gambit_ghoVariableDebtToken/bug153.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..396d3a7 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -483,7 +483,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     if (balanceIncrease != 0 && discountPercent != 0) {
       uint256 discount = balanceIncrease.percentMul(discountPercent);
       discountScaled = discount.rayDiv(index);
-      balanceIncrease = balanceIncrease - discount;
+      /// SwapArgumentsOperatorMutation(`balanceIncrease - discount` |==> `discount - balanceIncrease`) of: `balanceIncrease = balanceIncrease - discount;`
+      balanceIncrease = discount - balanceIncrease;
     }
 
     _userState[user].additionalData = index.toUint128();
