certora/mutations/gambit_ghoVariableDebtToken/bug155.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..4383dfe 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -486,7 +486,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
       balanceIncrease = balanceIncrease - discount;
     }
 
-    _userState[user].additionalData = index.toUint128();
+    /// AssignmentMutation(`index.toUint128()` |==> `0`) of: `_userState[user].additionalData = index.toUint128();`
+    _userState[user].additionalData = 0;
 
     _ghoUserState[user].accumulatedDebtInterest = (balanceIncrease +
       _ghoUserState[user].accumulatedDebtInterest).toUint128();
