certora/mutations/gambit_ghoVariableDebtToken/bug16.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..bb91dda 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -99,7 +99,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     _underlyingAsset = underlyingAsset;
     _incentivesController = incentivesController;
 
-    _domainSeparator = _calculateDomainSeparator();
+    /// AssignmentMutation(`_calculateDomainSeparator()` |==> `0`) of: `_domainSeparator = _calculateDomainSeparator();`
+    _domainSeparator = 0;
 
     emit Initialized(
       underlyingAsset,
