certora/mutations/gambit_ghoVariableDebtToken/bug162.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..3feb861 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -512,7 +512,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
       discountTokenBalance
     );
 
-    if (previousDiscountPercent != newDiscountPercent) {
+    /// IfStatementMutation(`previousDiscountPercent != newDiscountPercent` |==> `true`) of: `if (previousDiscountPercent != newDiscountPercent) {`
+    if (true) {
       _ghoUserState[user].discountPercent = newDiscountPercent.toUint16();
       emit DiscountPercentUpdated(user, previousDiscountPercent, newDiscountPercent);
     }
