certora/mutations/gambit_ghoVariableDebtToken/bug164.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..53030f1 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -513,7 +513,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     );
 
     if (previousDiscountPercent != newDiscountPercent) {
-      _ghoUserState[user].discountPercent = newDiscountPercent.toUint16();
+      /// DeleteExpressionMutation(`_ghoUserState[user].discountPercent = newDiscountPercent.toUint16()` |==> `assert(true)`) of: `_ghoUserState[user].discountPercent = newDiscountPercent.toUint16();`
+      assert(true);
       emit DiscountPercentUpdated(user, previousDiscountPercent, newDiscountPercent);
     }
   }
