certora/mutations/gambit_ghoVariableDebtToken/bug18.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..1a6e1f1 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -121,7 +121,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
   function balanceOf(address user) public view virtual override returns (uint256) {
     uint256 scaledBalance = super.balanceOf(user);
 
-    if (scaledBalance == 0) {
+    /// IfStatementMutation(`scaledBalance == 0` |==> `false`) of: `if (scaledBalance == 0) {`
+    if (false) {
       return 0;
     }
 
