certora/mutations/gambit_ghoVariableDebtToken/bug26.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..3f861e0 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -134,7 +134,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
 
     uint256 discountPercent = _ghoUserState[user].discountPercent;
     if (discountPercent != 0) {
-      uint256 balanceIncrease = balance - scaledBalance.rayMul(previousIndex);
+      /// BinaryOpMutation(`-` |==> `%`) of: `uint256 balanceIncrease = balance - scaledBalance.rayMul(previousIndex);`
+      uint256 balanceIncrease = balance%scaledBalance.rayMul(previousIndex);
       balance -= balanceIncrease.percentMul(discountPercent);
     }
 
