certora/mutations/gambit_ghoVariableDebtToken/bug29.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..0532646 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -135,7 +135,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     uint256 discountPercent = _ghoUserState[user].discountPercent;
     if (discountPercent != 0) {
       uint256 balanceIncrease = balance - scaledBalance.rayMul(previousIndex);
-      balance -= balanceIncrease.percentMul(discountPercent);
+      /// DeleteExpressionMutation(`balance -= balanceIncrease.percentMul(discountPercent)` |==> `assert(true)`) of: `balance -= balanceIncrease.percentMul(discountPercent);`
+      assert(true);
     }
 
     return balance;
