certora/mutations/gambit_ghoVariableDebtToken/bug42.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..59ae32e 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -215,7 +215,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
 
   /// @inheritdoc IGhoVariableDebtToken
   function setAToken(address ghoAToken) external override onlyPoolAdmin {
-    require(_ghoAToken == address(0), 'ATOKEN_ALREADY_SET');
+    /// DeleteExpressionMutation(`require(_ghoAToken == address(0), 'ATOKEN_ALREADY_SET')` |==> `assert(true)`) of: `require(_ghoAToken == address(0), 'ATOKEN_ALREADY_SET');`
+    assert(true);
     require(ghoAToken != address(0), 'ZERO_ADDRESS_NOT_VALID');
     _ghoAToken = ghoAToken;
     emit ATokenSet(ghoAToken);
