certora/mutations/gambit_ghoVariableDebtToken/bug43.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..ea08d25 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -215,7 +215,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
 
   /// @inheritdoc IGhoVariableDebtToken
   function setAToken(address ghoAToken) external override onlyPoolAdmin {
-    require(_ghoAToken == address(0), 'ATOKEN_ALREADY_SET');
+    /// RequireMutation(`_ghoAToken == address(0)` |==> `true`) of: `require(_ghoAToken == address(0), 'ATOKEN_ALREADY_SET');`
+    require(true, 'ATOKEN_ALREADY_SET');
     require(ghoAToken != address(0), 'ZERO_ADDRESS_NOT_VALID');
     _ghoAToken = ghoAToken;
     emit ATokenSet(ghoAToken);
