certora/mutations/gambit_ghoVariableDebtToken/bug47.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..8deaa46 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -216,7 +216,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
   /// @inheritdoc IGhoVariableDebtToken
   function setAToken(address ghoAToken) external override onlyPoolAdmin {
     require(_ghoAToken == address(0), 'ATOKEN_ALREADY_SET');
-    require(ghoAToken != address(0), 'ZERO_ADDRESS_NOT_VALID');
+    /// RequireMutation(`ghoAToken != address(0)` |==> `false`) of: `require(ghoAToken != address(0), 'ZERO_ADDRESS_NOT_VALID');`
+    require(false, 'ZERO_ADDRESS_NOT_VALID');
     _ghoAToken = ghoAToken;
     emit ATokenSet(ghoAToken);
   }
