certora/mutations/gambit_ghoVariableDebtToken/bug48.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..f0d4c4f 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -217,7 +217,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
   function setAToken(address ghoAToken) external override onlyPoolAdmin {
     require(_ghoAToken == address(0), 'ATOKEN_ALREADY_SET');
     require(ghoAToken != address(0), 'ZERO_ADDRESS_NOT_VALID');
-    _ghoAToken = ghoAToken;
+    /// DeleteExpressionMutation(`_ghoAToken = ghoAToken` |==> `assert(true)`) of: `_ghoAToken = ghoAToken;`
+    assert(true);
     emit ATokenSet(ghoAToken);
   }
 
