certora/mutations/gambit_ghoVariableDebtToken/bug49.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..ee7bef5 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -230,7 +230,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
   function updateDiscountRateStrategy(
     address newDiscountRateStrategy
   ) external override onlyPoolAdmin {
-    require(newDiscountRateStrategy != address(0), 'ZERO_ADDRESS_NOT_VALID');
+    /// DeleteExpressionMutation(`require(newDiscountRateStrategy != address(0), 'ZERO_ADDRESS_NOT_VALID')` |==> `assert(true)`) of: `require(newDiscountRateStrategy != address(0), 'ZERO_ADDRESS_NOT_VALID');`
+    assert(true);
     address oldDiscountRateStrategy = address(_discountRateStrategy);
     _discountRateStrategy = IGhoDiscountRateStrategy(newDiscountRateStrategy);
     emit DiscountRateStrategyUpdated(oldDiscountRateStrategy, newDiscountRateStrategy);
