certora/mutations/gambit_ghoVariableDebtToken/bug51.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..18842b6 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -230,7 +230,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
   function updateDiscountRateStrategy(
     address newDiscountRateStrategy
   ) external override onlyPoolAdmin {
-    require(newDiscountRateStrategy != address(0), 'ZERO_ADDRESS_NOT_VALID');
+    /// RequireMutation(`newDiscountRateStrategy != address(0)` |==> `false`) of: `require(newDiscountRateStrategy != address(0), 'ZERO_ADDRESS_NOT_VALID');`
+    require(false, 'ZERO_ADDRESS_NOT_VALID');
     address oldDiscountRateStrategy = address(_discountRateStrategy);
     _discountRateStrategy = IGhoDiscountRateStrategy(newDiscountRateStrategy);
     emit DiscountRateStrategyUpdated(oldDiscountRateStrategy, newDiscountRateStrategy);
