certora/mutations/gambit_ghoVariableDebtToken/bug52.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..9169773 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -232,7 +232,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
   ) external override onlyPoolAdmin {
     require(newDiscountRateStrategy != address(0), 'ZERO_ADDRESS_NOT_VALID');
     address oldDiscountRateStrategy = address(_discountRateStrategy);
-    _discountRateStrategy = IGhoDiscountRateStrategy(newDiscountRateStrategy);
+    /// DeleteExpressionMutation(`_discountRateStrategy = IGhoDiscountRateStrategy(newDiscountRateStrategy)` |==> `assert(true)`) of: `_discountRateStrategy = IGhoDiscountRateStrategy(newDiscountRateStrategy);`
+    assert(true);
     emit DiscountRateStrategyUpdated(oldDiscountRateStrategy, newDiscountRateStrategy);
   }
 
