certora/mutations/gambit_ghoVariableDebtToken/bug66.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..bdf7e8e 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -288,7 +288,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
       _refreshDiscountPercent(
         sender,
         super.balanceOf(sender).rayMul(index),
-        senderDiscountTokenBalance - amount,
+        /// BinaryOpMutation(`-` |==> `%`) of: `senderDiscountTokenBalance - amount,`
+        senderDiscountTokenBalance%amount,
         _ghoUserState[sender].discountPercent
       );
 
