certora/mutations/gambit_ghoVariableDebtToken/bug71.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..b76b1df 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -296,7 +296,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
       emit Mint(address(0), sender, balanceIncrease, balanceIncrease, index);
     }
 
-    if (recipientPreviousScaledBalance > 0) {
+    /// SwapArgumentsOperatorMutation(`recipientPreviousScaledBalance > 0` |==> `0 > recipientPreviousScaledBalance`) of: `if (recipientPreviousScaledBalance > 0) {`
+    if (0 > recipientPreviousScaledBalance) {
       (balanceIncrease, discountScaled) = _accrueDebtOnAction(
         recipient,
         recipientPreviousScaledBalance,
