certora/mutations/gambit_ghoVariableDebtToken/bug86.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..c9c831e 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -387,7 +387,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     );
 
     // confirm the amount being borrowed is greater than the discount
-    if (amountScaled > discountScaled) {
+    /// IfStatementMutation(`amountScaled > discountScaled` |==> `true`) of: `if (amountScaled > discountScaled) {`
+    if (true) {
       _mint(onBehalfOf, (amountScaled - discountScaled).toUint128());
     } else {
       _burn(onBehalfOf, (discountScaled - amountScaled).toUint128());
