certora/mutations/gambit_ghoVariableDebtToken/bug87.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..54c4260 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -387,7 +387,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     );
 
     // confirm the amount being borrowed is greater than the discount
-    if (amountScaled > discountScaled) {
+    /// IfStatementMutation(`amountScaled > discountScaled` |==> `false`) of: `if (amountScaled > discountScaled) {`
+    if (false) {
       _mint(onBehalfOf, (amountScaled - discountScaled).toUint128());
     } else {
       _burn(onBehalfOf, (discountScaled - amountScaled).toUint128());
