certora/mutations/gambit_ghoVariableDebtToken/bug90.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..6113911 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -390,7 +390,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     if (amountScaled > discountScaled) {
       _mint(onBehalfOf, (amountScaled - discountScaled).toUint128());
     } else {
-      _burn(onBehalfOf, (discountScaled - amountScaled).toUint128());
+      /// BinaryOpMutation(`-` |==> `+`) of: `_burn(onBehalfOf, (discountScaled - amountScaled).toUint128());`
+      _burn(onBehalfOf, (discountScaled+amountScaled).toUint128());
     }
 
     _refreshDiscountPercent(
