certora/mutations/gambit_ghoVariableDebtToken/bug99.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..f31fbf1 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -388,7 +388,8 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
 
     // confirm the amount being borrowed is greater than the discount
     if (amountScaled > discountScaled) {
-      _mint(onBehalfOf, (amountScaled - discountScaled).toUint128());
+      /// BinaryOpMutation(`-` |==> `/`) of: `_mint(onBehalfOf, (amountScaled - discountScaled).toUint128());`
+      _mint(onBehalfOf, (amountScaled/discountScaled).toUint128());
     } else {
       _burn(onBehalfOf, (discountScaled - amountScaled).toUint128());
     }
