certora/mutations/manual_ghoAToken/bug1.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoAToken.sol b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
index 8cb1587..b9e4199 100644
--- a/src/contracts/facilitators/aave/tokens/GhoAToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
@@ -167,7 +167,7 @@ contract GhoAToken is VersionedInitializable, ScaledBalanceTokenBase, EIP712Base
     if (amount <= balanceFromInterest) {
       _ghoVariableDebtToken.decreaseBalanceFromInterest(onBehalfOf, amount);
     } else {
-      _ghoVariableDebtToken.decreaseBalanceFromInterest(onBehalfOf, balanceFromInterest);
+      //_ghoVariableDebtToken.decreaseBalanceFromInterest(onBehalfOf, balanceFromInterest);
       IGhoToken(_underlyingAsset).burn(amount - balanceFromInterest);
     }
   }
