certora/mutations/manual_ghoAToken/bug15.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoAToken.sol b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
index 8cb1587..ae5cb3a 100644
--- a/src/contracts/facilitators/aave/tokens/GhoAToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
@@ -173,7 +173,7 @@ contract GhoAToken is VersionedInitializable, ScaledBalanceTokenBase, EIP712Base
   }
 
   /// @inheritdoc IGhoFacilitator
-  function distributeFeesToTreasury() external virtual override {
+  function distributeFeesToTreasury() external virtual override onlyPoolAdmin {
     uint256 balance = IERC20(_underlyingAsset).balanceOf(address(this));
     IERC20(_underlyingAsset).transfer(_ghoTreasury, balance);
     emit FeesDistributedToTreasury(_ghoTreasury, _underlyingAsset, balance);
