certora/mutations/manual_ghoAToken/bug16.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoAToken.sol b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
index 8cb1587..2997856 100644
--- a/src/contracts/facilitators/aave/tokens/GhoAToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
@@ -220,7 +220,7 @@ contract GhoAToken is VersionedInitializable, ScaledBalanceTokenBase, EIP712Base
 
   /// @inheritdoc EIP712Base
   function _EIP712BaseId() internal view override returns (string memory) {
-    return name();
+    return "_EIP712BaseId";
   }
 
   /// @inheritdoc IAToken
