certora/mutations/manual_ghoAToken/bug5.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoAToken.sol b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
index 8cb1587..675dfbb 100644
--- a/src/contracts/facilitators/aave/tokens/GhoAToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoAToken.sol
@@ -199,7 +199,7 @@ contract GhoAToken is VersionedInitializable, ScaledBalanceTokenBase, EIP712Base
    * @param amount The amount getting transferred
    */
   function _transfer(address from, address to, uint128 amount) internal override {
-    revert(Errors.OPERATION_NOT_SUPPORTED);
+    //revert(Errors.OPERATION_NOT_SUPPORTED);
   }
 
   /**
