certora/mutations/manual_ghoFlashMinter/bug11.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..16f837d 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -108,7 +108,7 @@ contract GhoFlashMinter is IGhoFlashMinter {
 
   /// @inheritdoc IERC3156FlashLender
   function maxFlashLoan(address token) external view override returns (uint256) {
-    if (token != address(GHO_TOKEN)) {
+    if (token == address(GHO_TOKEN)) {
       return 0;
     } else {
       (uint256 capacity, uint256 level) = GHO_TOKEN.getFacilitatorBucket(address(this));
