certora/mutations/manual_ghoFlashMinter/bug12.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..47595ab 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -111,7 +111,7 @@ contract GhoFlashMinter is IGhoFlashMinter {
     if (token != address(GHO_TOKEN)) {
       return 0;
     } else {
-      (uint256 capacity, uint256 level) = GHO_TOKEN.getFacilitatorBucket(address(this));
+      (uint256 level, uint256 capacity) = GHO_TOKEN.getFacilitatorBucket(address(this));
       return capacity > level ? capacity - level : 0;
     }
   }
