certora/mutations/manual_ghoFlashMinter/bug24.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..fba43df 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -74,7 +74,7 @@ contract GhoFlashMinter is IGhoFlashMinter {
     require(token == address(GHO_TOKEN), 'FlashMinter: Unsupported currency');
 
     uint256 fee = ACL_MANAGER.isFlashBorrower(msg.sender) ? 0 : _flashFee(amount);
-    GHO_TOKEN.mint(address(receiver), amount);
+    //GHO_TOKEN.mint(address(receiver), amount);
 
     require(
       receiver.onFlashLoan(msg.sender, address(GHO_TOKEN), amount, fee, data) == CALLBACK_SUCCESS,
