certora/mutations/manual_ghoFlashMinter/bug25.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..69d1d69 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -81,7 +81,7 @@ contract GhoFlashMinter is IGhoFlashMinter {
       'FlashMinter: Callback failed'
     );
 
-    GHO_TOKEN.transferFrom(address(receiver), address(this), amount + fee);
+    GHO_TOKEN.transferFrom(address(receiver), address(_ghoTreasury), amount + fee);
     GHO_TOKEN.burn(amount);
 
     emit FlashMint(address(receiver), msg.sender, address(GHO_TOKEN), amount, fee);
