certora/mutations/manual_ghoFlashMinter/bug6.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..b13f2e5 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -143,7 +143,7 @@ contract GhoFlashMinter is IGhoFlashMinter {
   }
 
   function _updateFee(uint256 newFee) internal {
-    require(newFee <= MAX_FEE, 'FlashMinter: Fee out of range');
+    require(newFee < MAX_FEE, 'FlashMinter: Fee out of range');
     uint256 oldFee = _fee;
     _fee = newFee;
     emit FeeUpdated(oldFee, newFee);
