certora/mutations/manual_ghoFlashMinter/bug8.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..1f6614a 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -119,7 +119,7 @@ contract GhoFlashMinter is IGhoFlashMinter {
   /// @inheritdoc IERC3156FlashLender
   function flashFee(address token, uint256 amount) external view override returns (uint256) {
     require(token == address(GHO_TOKEN), 'FlashMinter: Unsupported currency');
-    return ACL_MANAGER.isFlashBorrower(msg.sender) ? 0 : _flashFee(amount);
+    return ACL_MANAGER.isFlashBorrower(msg.sender) ? _flashFee(amount) : 0;
   }
 
   /// @inheritdoc IGhoFlashMinter
