certora/mutations/manual_ghoFlashMinter/bug9.patch
diff --git a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
index dc829f0..8a41e71 100644
--- a/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
+++ b/src/contracts/facilitators/flashMinter/GhoFlashMinter.sol
@@ -139,7 +139,7 @@ contract GhoFlashMinter is IGhoFlashMinter {
    * @return The amount of `token` to be charged for the flashloan, on top of the returned principal.
    */
   function _flashFee(uint256 amount) internal view returns (uint256) {
-    return amount.percentMul(_fee);
+    return _fee * amount;
   }
 
   function _updateFee(uint256 newFee) internal {
