certora/mutations/manual_ghoToken/bug1.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..2694065 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -70,7 +70,7 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     require(bytes(facilitatorLabel).length > 0, 'INVALID_LABEL');
 
     facilitator.label = facilitatorLabel;
-    facilitator.bucketCapacity = bucketCapacity;
+    facilitator.bucketCapacity = 0;
 
     _facilitatorsList.add(facilitatorAddress);
 
