certora/mutations/manual_ghoToken/bug10.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..2c5f05d 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -40,7 +40,7 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     require(f.bucketCapacity >= newBucketLevel, 'FACILITATOR_BUCKET_CAPACITY_EXCEEDED');
     f.bucketLevel = uint128(newBucketLevel);
 
-    _mint(account, amount);
+    _mint(account, currentBucketLevel);
 
     emit FacilitatorBucketLevelUpdated(msg.sender, currentBucketLevel, newBucketLevel);
   }
