certora/mutations/manual_ghoToken/bug11.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..736b708 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -40,7 +40,7 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     require(f.bucketCapacity >= newBucketLevel, 'FACILITATOR_BUCKET_CAPACITY_EXCEEDED');
     f.bucketLevel = uint128(newBucketLevel);
 
-    _mint(account, amount);
+    _mint(account, currentBucketLevel);
 
     emit FacilitatorBucketLevelUpdated(msg.sender, currentBucketLevel, newBucketLevel);
   }
@@ -51,7 +51,7 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
 
     Facilitator storage f = _facilitators[msg.sender];
     uint256 currentBucketLevel = f.bucketLevel;
-    uint256 newBucketLevel = currentBucketLevel - amount;
+    uint256 newBucketLevel = currentBucketLevel + amount;
     f.bucketLevel = uint128(newBucketLevel);
 
     _burn(msg.sender, amount);
