certora/mutations/manual_ghoToken/bug15.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..22b24aa 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -67,7 +67,7 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
   ) external onlyRole(FACILITATOR_MANAGER_ROLE) {
     Facilitator storage facilitator = _facilitators[facilitatorAddress];
     require(bytes(facilitator.label).length == 0, 'FACILITATOR_ALREADY_EXISTS');
-    require(bytes(facilitatorLabel).length > 0, 'INVALID_LABEL');
+    //require(bytes(facilitatorLabel).length > 0, 'INVALID_LABEL');
 
     facilitator.label = facilitatorLabel;
     facilitator.bucketCapacity = bucketCapacity;
