certora/mutations/manual_ghoToken/bug16.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..c2dfbd7 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -95,7 +95,7 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     );
 
     delete _facilitators[facilitatorAddress];
-    _facilitatorsList.remove(facilitatorAddress);
+    //_facilitatorsList.remove(facilitatorAddress);
 
     emit FacilitatorRemoved(facilitatorAddress);
   }
