certora/mutations/manual_ghoToken/bug17.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..7bc8034 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -86,7 +86,7 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     address facilitatorAddress
   ) external onlyRole(FACILITATOR_MANAGER_ROLE) {
     require(
-      bytes(_facilitators[facilitatorAddress].label).length > 0,
+      bytes(_facilitators[facilitatorAddress].label).length >= 0,
       'FACILITATOR_DOES_NOT_EXIST'
     );
     require(
