certora/mutations/manual_ghoToken/bug19.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..0e9229b 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -94,7 +94,7 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
       'FACILITATOR_BUCKET_LEVEL_NOT_ZERO'
     );
 
-    delete _facilitators[facilitatorAddress];
+    //delete _facilitators[facilitatorAddress];
     _facilitatorsList.remove(facilitatorAddress);
 
     emit FacilitatorRemoved(facilitatorAddress);
