certora/mutations/manual_ghoToken/bug6.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..a452e1a 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -64,7 +64,7 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     address facilitatorAddress,
     string memory facilitatorLabel, // munged calldata to memory - AT Certora
     uint128 bucketCapacity
-  ) external onlyRole(FACILITATOR_MANAGER_ROLE) {
+  ) external {
     Facilitator storage facilitator = _facilitators[facilitatorAddress];
     require(bytes(facilitator.label).length == 0, 'FACILITATOR_ALREADY_EXISTS');
     require(bytes(facilitatorLabel).length > 0, 'INVALID_LABEL');
