certora/mutations/manual_ghoToken/bug7.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..0f5b8e8 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -104,7 +104,7 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
   function setFacilitatorBucketCapacity(
     address facilitator,
     uint128 newCapacity
-  ) external onlyRole(BUCKET_MANAGER_ROLE) {
+  ) external onlyRole(FACILITATOR_MANAGER_ROLE) {
     require(bytes(_facilitators[facilitator].label).length > 0, 'FACILITATOR_DOES_NOT_EXIST');
 
     uint256 oldCapacity = _facilitators[facilitator].bucketCapacity;
