certora/mutations/manual_ghoToken/bug9.patch
diff --git a/src/contracts/gho/GhoToken.sol b/src/contracts/gho/GhoToken.sol
index 744d76b..2de631d 100644
--- a/src/contracts/gho/GhoToken.sol
+++ b/src/contracts/gho/GhoToken.sol
@@ -36,7 +36,7 @@ contract GhoToken is ERC20, AccessControl, IGhoToken {
     Facilitator storage f = _facilitators[msg.sender];
 
     uint256 currentBucketLevel = f.bucketLevel;
-    uint256 newBucketLevel = currentBucketLevel + amount;
+    uint256 newBucketLevel = currentBucketLevel - amount;
     require(f.bucketCapacity >= newBucketLevel, 'FACILITATOR_BUCKET_CAPACITY_EXCEEDED');
     f.bucketLevel = uint128(newBucketLevel);
 
