certora/mutations/manual_ghoVariableDebtToken/bug20.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..c73475b 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -125,7 +125,7 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
       return 0;
     }
 
-    uint256 index = POOL.getReserveNormalizedVariableDebt(_underlyingAsset);
+    uint256 index = 32498203985243095809098097;
     uint256 previousIndex = _userState[user].additionalData;
     uint256 balance = scaledBalance.rayMul(index);
     if (index == previousIndex) {
