certora/mutations/manual_ghoVariableDebtToken/bug3.patch
diff --git a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
index 3716480..266f057 100644
--- a/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
+++ b/src/contracts/facilitators/aave/tokens/GhoVariableDebtToken.sol
@@ -99,7 +99,7 @@ contract GhoVariableDebtToken is DebtTokenBase, ScaledBalanceTokenBase, IGhoVari
     _underlyingAsset = underlyingAsset;
     _incentivesController = incentivesController;
 
-    _domainSeparator = _calculateDomainSeparator();
+    // _domainSeparator = _calculateDomainSeparator();
 
     emit Initialized(
       underlyingAsset,
